Ran Plan for dir: `terraform/EC2-Instance` workspace: `default`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.compute.aws_instance.app_server[1] will be created
+ resource "aws_instance" "app_server" {
      + ami                                  = "ami-078c1149d8ad719a7"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "m1_adm"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "demo-app-2"
        }
      + tags_all                             = {
          + "Name" = "demo-app-2"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-0a41851b9762ab02b",
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
~ public_ips = [
        "54.169.62.178",
      + (known after apply),
    ]

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/EC2-Instance`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.demo-with-klept.online/lock?id=klept-lab%252Fdemo-with-klept%252Fterraform%252FEC2-Instance%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/EC2-Instance`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
